<template>
  <div class="places_block_container">
    <div
      class="interesting_place_wrapper"
      v-for="place in interesting_places"
      :key="place.id"
    >
      <InterestingPlace :interesting_place="place" />
    </div>
  </div>
</template>

<script>
import InterestingPlace from "~/blocks/our_blog/one_news/InterestingPlace";
export default {
  name: "PlacesBlock",
  components: {
    InterestingPlace,
  },
  data: () => ({
    interesting_places: [
      {
        id: 0,
        title: "Супербоул",
        place: "Маямі (Флорида), США",
        description:
          "Супербоул (чи Суперкубок) — це фінальна гра сезону в професійному американському футболі, яка для американців є чимось на кшталт національного свята. До того ж, це найпопулярніше телешоу року: найбагатші компанії витрачають мільйони доларів не лише на рекламний слот під час трансляції матчу (одна хвилина ефіру коштує приблизно 8 мільйонів доларів), а й на креатив. Не менш важливою традицією Суперкубку є музичне хафтайм-шоу, що проходить у перерві між таймами. Тому за багато років Супербоул перетворився на самостійну розвагу навіть для тих, кого футбол не дуже й цікавить. Квитки можна придбати на офіційному сайті, ціна стартує від 4 725 доларів. Але не менш захопливий досвід (і точно фінансово привабливіший) — переглянути фінал в одному з численних барів чи пабів Америки. Головне забронювати місце заздалегідь.",
        list: [
          "Розташування в центрі мегаполісу",
          "Розкішні готельні номери",
          "Ресторани високої кухні",
          "Fresh Organic Traditional",
          "Преміальний конференц-сервіс ",
          "фітнес-центр з басейном і спа",
        ],
      },
      {
        id: 1,
        title: "Супербоул",
        place: "Маямі (Флорида), США",
        description:
          "Супербоул (чи Суперкубок) — це фінальна гра сезону в професійному американському футболі, яка для американців є чимось на кшталт національного свята. До того ж, це найпопулярніше телешоу року: найбагатші компанії витрачають мільйони доларів не лише на рекламний слот під час трансляції матчу (одна хвилина ефіру коштує приблизно 8 мільйонів доларів), а й на креатив. Не менш важливою традицією Суперкубку є музичне хафтайм-шоу, що проходить у перерві між таймами. Тому за багато років Супербоул перетворився на самостійну розвагу навіть для тих, кого футбол не дуже й цікавить. Квитки можна придбати на офіційному сайті, ціна стартує від 4 725 доларів. Але не менш захопливий досвід (і точно фінансово привабливіший) — переглянути фінал в одному з численних барів чи пабів Америки. Головне забронювати місце заздалегідь.",
      },
    ],
  }),
};
</script>

<style lang="scss" scoped>
@import "../../../assets/scss/utils.scss";

.places_block_container {
  @include pb-140;

  @include max(lg) {
    padding-bottom: 112px;
  }
  @include max(md) {

  }
  @include max(sm) {
  }
}
</style>
